INSERT INTO department (department_id) VALUES (1), (2), (3);

INSERT INTO program (program_id, name_program, plan, department_id) VALUES
(1, 'Программная инженерия', 120, 1),
(2, 'Прикладная математика', 120, 1),
(3, 'Экономика', 130, 2),
(4, 'Менеджмент', 150, 2),
(5, 'Дизайн', 130, 3);

-- INSERT INTO subject (subject_id, name_subject) VALUES
-- (7, 'Рисунок');

-- (1, 'Математика'),
-- (2, 'Русский язык'),
-- (3, 'Информатика'),
-- (4, 'Обществознание'),
-- (5, 'Иностранный язык'),
-- (6, 'История'),

INSERT INTO enrollee (enrollee_id, name_enrollee) VALUES
(1, 'Иванов Иван Иванович'),
(2, 'Петрова Анна Сергеевна'),
(3, 'Сидоров Петр Алексеевич'),
(4, 'Козлова Елена Дмитриевна'),
(5, 'Смирнов Алексей Владимирович'),
(6, 'Васильева Ольга Павловна'),
(7, 'Николаев Дмитрий Сергеевич'),
(8, 'Морозова Татьяна Игоревна');

INSERT INTO program_enrollee (program_enrollee_id, program_id, enrollee_id) VALUES
(1, 1, 1),
(2, 1, 3),
(3, 1, 5),
(4, 2, 2),
(5, 2, 4),
(6, 2, 6),
(7, 3, 1),
(8, 3, 2),
(9, 3, 7),
(10, 4, 4),
(11, 4, 5),
(12, 4, 8),
(13, 5, 3),
(14, 5, 6),
(15, 5, 8);

INSERT INTO program_subject (program_subject_id, program_id, subject_id, min_result) VALUES
(1, 1, 1, 60),
(2, 1, 2, 55),
(3, 1, 3, 65),
(4, 2, 1, 65),
(5, 2, 2, 55),
(6, 2, 6, 60),
(7, 3, 1, 50),
(8, 3, 2, 50),
(9, 3, 4, 55),
(10, 4, 2, 50),
(11, 4, 4, 55),
(12, 4, 5, 60),
(13, 5, 2, 45),
(14, 5, 7, 70);

INSERT INTO enrollee_subject (enrollee_subject_id, enrollee_id, subject_id) VALUES
(1, 1, 1),
(2, 1, 2),
(3, 1, 3),
(4, 2, 1),
(5, 2, 2),
(6, 2, 6),
(7, 3, 1),
(8, 3, 2),
(9, 3, 3),
(10, 3, 7),
(11, 4, 1),
(12, 4, 2),
(13, 4, 4),
(14, 4, 5),
(15, 5, 2),
(16, 5, 4),
(17, 5, 5),
(18, 6, 1),
(19, 6, 2),
(20, 6, 6),
(21, 6, 7),
(22, 7, 1),
(23, 7, 2),
(24, 7, 4),
(25, 8, 2),
(26, 8, 4),
(27, 8, 5),
(28, 8, 7);

INSERT INTO achievement (achievement_id, name_achievement, bonus) VALUES
(1, 'Золотая медаль', 10),
(2, 'Серебряная медаль', 5),
(3, 'Значок ГТО', 3),
(4, 'Волонтерская деятельность', 2),
(5, 'Олимпиада по математике', 8),
(6, 'Олимпиада по информатике', 8),
(7, 'Спортивные достижения', 4);

INSERT INTO enrollee_achievement (enrollee_achievement_id, enrollee_id, achievement_id) VALUES
(1, 1, 1),
(2, 1, 3),
(3, 2, 2),
(4, 2, 7),
(5, 3, 5),
(6, 4, 4),
(7, 4, 6),
(8, 5, 3),
(9, 6, 1),
(10, 7, 2),
(11, 8, 4),
(12, 8, 7);